# SpotLightDistribution Constructor

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
SpotLightDistribution Constructor
SpotLightDistribution Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| SpotLightDistribution()()()() | Creates a spot light distribution object with the following values; |

  * PI/6 radians spot beam angle
  * PI/2 radians spot field angle
  * PI/6 radians tilt angle

| SpotLightDistribution(SpotLightDistribution)|  Creates a copy of the given spotlight distribution
| SpotLightDistribution(Double, Double, Double)|  Creates a spot light distribution object with the given values.
# See Also
SpotLightDistribution Class
SpotLightDistribution Members
Autodesk.Revit.DB.Lighting Namespace